# Clone Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
LightDistribution..::..Clone Method
LightDistribution Class See Also
---
Creates a copy of the LightDistribution derived object.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public LightDistribution Clone()
```

Visual Basic
---
```text
Public Function Clone As LightDistribution
```

Visual C++
---
```text
public:
LightDistribution^ Clone()
```

# See Also
LightDistribution Class
Autodesk.Revit.DB.Lighting Namespace